#include <stdio.h>

int main() {
//// 사용자로부터 정수로 초를 입력받아 시분초 형식으로 출력하는 프로그램
//
//	int h;
//	int m;
//	int s;
//	int temp;
//	
//	scanf("%d", &s);
//
//	temp = s;
//	h = s / 3600;
//	m = (s%3600) / 60;
//	s = (s%3600) % 60;
//
//	printf("%d초는 %02d시간 %02d분 %02d초 입니다.", temp, h, m, s);
//	// 출력 숫자에 0을 넣고 싶을 땐 %02d를 사용하면 된다.
//===================================================================================

	//int a = 5, b = 5;
	//int pre, post;

	//printf("초기 값 : a = %d, b = %d\n", a, b);

	//pre = (++a) * 3;
	//post = (b++) * 3;

	//printf("현재 값 : a = %d, b = %d\n", a, b);
	//printf("전위형 : (++a) * 3 = %d, 후위형 : (b++) * 3 = %d", pre, post);

	//// (++a) + a + (a++)
	//// 이런 코드는 생각해본적도 없지만...절대로 쓰지 말라고 한다
	//===================================================================================

	//int a = 30;
	//int res;

	//res = (a > 10) && (a < 20);
	//printf("(a > 10) && (a < 20) : %d\n", res);
	//res = (a < 10) || (a > 20);
	//printf("(a < 10) && (a > 20) : %d\n", res);
	//res = !(a >= 30);
	//printf("! (a >= 30) : %d\n", res);
	//// &&와 ||는 숏서킷 룰이 적용되어 좌항만 성립하지 않아도 우항을 판단하지 않는다.
	//===================================================================================

	//double a = 4.0, b = 1.2;

	//printf("%.1lf + %.1lf = %.1lf\n",a, b, a+b);
	//printf("%.1lf - %.1lf = %.1lf\n", a, b, a-b);
	//printf("%.1lf * %.1lf = %.1lf\n", a, b, a*b);
	//printf("%.1lf / %.1lf = %.1lf\n", a, b, a/b);
	//===================================================================================

	//int nInput = 0;
	//int dTotal = 0;
	//double avg;

	//printf("점수 입력 : ");
	//scanf("%d", &nInput);
	//printf("첫 번째 과목의 점수 : %d\n", nInput);
	//dTotal += nInput;

	//printf("점수 입력 : ");
	//scanf("%d", &nInput);
	//printf("두 번째 과목의 점수 : %d\n", nInput);
	//dTotal += nInput;

	//printf("점수 입력 : ");
	//scanf("%d", &nInput);
	//printf("세 번째 과목의 점수 : %d\n", nInput);
	//dTotal += nInput;
	//
	//printf("평균 : %.2lf", (dTotal / 3.0));
	////나누기 할때 자료형을 맞춰주어야 한다.
	//===================================================================================

	///*신청 학점이 10학점 이상이고 평점 평균이 4.0을 넘기면 1 아니면 0*/
	//int kor = 3;
	//int eng = 5;
	//int mat = 4;
	//int credits = 0;
	//int res = 0;
	//double kscore = 3.8;
	//double escore = 4.4;
	//double mscore = 3.9;
	//double grade = 0;

	//res = (kor + eng + mat) >= 10 && (kscore + escore + mscore) / 3.0 > 4.0;
	//printf("%d", res);
	//===================================================================================

	//int a, b, c;
	//int temp;

	//scanf("%d%d%d", &a, &b, &c);

	//// 조건(삼항)연산자
	//temp = (a > b) ? a : b;
	//temp = (c > temp) ? c : temp;

	//printf("%d", temp);
	//===================================================================================

	int N, M;
	int lifeM = 80 * 365 * 24 * 60; // 수명을 80년으로 가정하고 계산
	int lifeM_rest = 20 * 365 * 24 * 60; // 계산 결과에 더해줄 20년
	int wasteM = 0;
	
	scanf("%d%d", N, M);



	return 0;
}