#include <stdio.h>

int main() {
	//조건문이 1 이상이면 항상 실행
	//int a = 20;
	//int b = 0;

	//if (a > 10) {
	//	b = a;
	//}

	//printf("a : %d, b : %d\n", a, b);
	/*===========================================================================*/
	//조건 분기
	//int a = 5;
	//
	//if (a > 10) {
	//	printf("a는 10보다 크다");
	//}
	//else {
	//	printf("a는 10보다 작거나 같다");
	//}
	/*===========================================================================*/
	//int a = 0, b = 0;

	//if (a > 0) {
	//	b = 1;
	//}
	//else if (a == 0) {
	//	b = 2;
	//}
	//else {
	//	b = 3;
	//}
	//printf("b : %d\n", b);
	/*===========================================================================*/
	//int a;

	//if (a < 0) {
	//	a = -a;
	//}
	/*===========================================================================*/
	//int a;
	//
	//if (a % 2 == 0) {
	//	a = 2;
	//}
	//else {
	//	a = 1;
	//}
	/*===========================================================================*/
	//int chest = 95;
	//char size;

	//if (chest <= 90) {
	//	size = 'S';
	//}
	//else if (chest > 90  && chest <= 100) {
	//	size = 'M';
	//}
	//else {
	//	size = 'L';
	//}
	/*===========================================================================*/
	//double height = 179.5;
	//double weight = 75.0;

	//if (height >= 187.5 && weight < 80) {
	//	printf("ok\n");
	//}
	//else {
	//	printf("cancle\n");
	//}
	/*===========================================================================*/
	//int a;
	//int b;

	//printf("두 정수 입력\n");
	//scanf("%d%d", &a, &b);

	//if (a >= b) {
	//	printf("%d", a - b);
	//}
	//else {
	//	printf("%d", b - a);
	//}
	/*===========================================================================*/
	//int a;
	//int b;

	//printf("두 정수 입력\n");
	//scanf("%d%d", &a, &b);

	//(a >= b) ? (printf("%d", a - b)) : (printf("%d", b - a));
	/*===========================================================================*/
	//int a = 20, b = 10;
	//
	//if (a > 10) {
	//	if (b >= 0) {
	//		b = 1;
	//	}
	//	else {
	//		b = -1;
	//	}
	//}
	//printf("a : %d, b : %d\n", a, b);
	/*===========================================================================*/
	//int a = 354;

	//switch (a) {
	//case 1:
	//	printf("good");
	//	break;
	//case 374:
	//	printf("goodgood");
	//	break;
	//default:
	//	printf("goodgoodgood");
	//	break;
	//}
	/*===========================================================================*/
	//double kor;
	//double eng;
	//double mat;
	//double avg;

	//printf("국어 점수 입력 : \n");
	//scanf("%lf", &kor);
	//printf("영어 점수 입력 : \n");
	//scanf("%lf", &eng);
	//printf("수학 점수 입력 : \n");
	//scanf("%lf", &mat);

	//avg = (kor + eng + mat) / (double)3;

	//printf("평균 점수 : %.2lf\n", avg);

	//if (avg >= 90) {
	//	printf("A");
	//}
	//else if (avg >= 80 && avg < 90) {
	//	printf("B");
	//}
	//else if (avg >= 70 && avg < 80) {
	//	printf("C");
	//}
	//else if (avg >= 60 && avg < 70) {
	//	printf("D");
	//}
	//else {
	//	printf("F");
	//}
	/*===========================================================================*/
	//int input1;
	//int input2;
	//char opt;

	//printf("수식 입력 : \n");
	//scanf("%d%c%d", &input1, &opt, &input2);

	//if (opt == '+') {
	//	printf("%d\n", input1 + input2);
	//}
	//else if (opt == '-') {
	//	printf("%d\n", input1 - input2);
	//}
	//else if (opt == '*') {
	//	printf("%d", input1 * input2);
	//}
	//else {
	//	printf("%d\n", input1 / input2);
	//}
	/*===========================================================================*/
